app/controllers/foos_controller.rb

  def index
    @foos = Foo.all
---
SELECT "foos".* FROM "foos"

  def create
    #sleep 2.5
    @foo = Foo.new(foo_params)

    if @foo.save
---
INSERT INTO "foos" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Angela Frami"], ["created_at", "2017-02-11 20:46:01.477984"], ["updated_at", "2017-02-11 20:46:01.477984"]]

  def update
    @foo = Foo.find(params[:id])

    if @foo.update(foo_params)
---
SELECT  "foos".* FROM "foos" WHERE "foos"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "foos" SET "name" = $1, "updated_at" = $2 WHERE "foos"."id" = $3  [["name", "testing"], ["updated_at", "2017-02-11 20:46:01.561625"], ["id", 8]]

  def destroy
    @foo.destroy
---
DELETE FROM "foos" WHERE "foos"."id" = $1  [["id", 9]]

    def set_foo
      @foo = Foo.find(params[:id])
---
SELECT  "foos".* FROM "foos" WHERE "foos"."id" = $1 LIMIT 1  [["id", 9]]